{
  "introduction": {
    "btns": {
      "about": "About me",
      "resume": "My Résumé"
    },
    "links": {
      "linkedInTitle": "My LinkedIn profile",
      "githubTitle": "My Github profile"
    },
    "learnMore": "Learn more"
  },
  "about": {
    "title": {
      "greeting": "Hey there!",
      "name": "I'm Isaque!"
    },
    "subTitle": "Passionate about creating web solutions and enthusiastic about AI, always exploring new ways to innovate and improve processes",
    "firstParagraph": "I am a full stack web developer with extensive experience in front-end. I have solid knowledge in jQuery, React, Next.js, and previous experience with Gatsby, which allows me to create intuitive and dynamic user interfaces, always applying the best practices and available technologies. My dedication to front-end development drives me to constantly strive for excellence and create engaging and accessible user experiences.",
    "secondParagraph": "In the back-end, I work efficiently using Node.js and Python to create REST APIs and develop automated ETL processes. I also have some experience with Java, which allows me to leverage its strengths in building robust backend services. My solid knowledge in relational databases, especially SQL Server, enables me to effectively manage and integrate data in complex systems",
    "thirdParagraph": "As a software engineer, I value efficiency in creating robust and scalable solutions. I prioritize writing clean and well-structured code, ensuring that solutions are sustainable and easy to maintain. Additionally, I am a strong advocate for AI, constantly exploring new technologies to optimize and transform processes, believing in AI's potential to revolutionize software development"
  },
  "experiences": {
    "title": "Experiences",
    "subTitle": "Some of my experiences as a developer and student",
    "card1date": "January 2020",
    "card1title": "Introduction to the world of development",
    "card1description": "My first 'Hello World'. It was here where I began studying on my own and became self-taught.",
    "card2date": "March 2020",
    "card2title": "Development of personal projects",
    "card2description": "After building a solid knowledge base, I decided to deepen my studies through the development of personal projects.",
    "card3date": "January 2021",
    "card3title": "Start of College",
    "card3description": "After a year of self-study and skill development, I decided to enroll in the Software Analysis and Development course at Universidade Cruzeiro do Sul.",
    "card4date": "June 2021",
    "card4title": "First professional experience",
    "card4description": "This is where I began working as a developer, working on web applications as a full stack developer.",
    "card5date": "January 2022",
    "card5title": "Joining 4MapIT",
    "card5description": "Here, I worked as a systems analyst, conducting requirements gathering, systems modeling, and web application development using jQuery, Node.js, and SQL Server.",
    "card6date": "January 2023",
    "card6title": "College Graduation",
    "card6description": "This is where I graduated as a systems analyst, learned database management, developed web and mobile applications, and primarily honed my skills in software engineering.",
    "card7date": "Present",
    "card7title": "What I do now?",
    "card7description": "Currently, I work full-time as a systems analyst at Octea. In my spare time, I work as a freelancer and continue to deepen my knowledge in various areas of technology, such as web application development, data science, machine learning, etc.",
    "present": "Present",
    "resume": {
      "title": "See my résumé",
      "text": "My Résumé"
    }
  },
  "projects": {
    "title": "My Projects",
    "subTitle": "Some of my personal and professional projects",
    "slideTip": "Tip: You can slide or click 'next' to see more projects"
  },
  "contact": {
    "title": "Send me a message!",
    "subTitle": "Got a question or proposal, or just want to say hello? Go ahead",
    "inputNamePlaceholder": "Enter your name",
    "inputEmailPlaceholder": "Enter your email",
    "inputMessagePlaceholder": "Write your message here",
    "inputButton": "Submit",
    "success": "Thanks for your message. I will get in touch as soon as possible! :)"
  },
  "resume": {
    "myInfo": {
      "role": "Software Engineer / Full Stack Developer",
      "location": "São Paulo, Brazil"
    },
    "subtitle": "Passionate about creating web solutions and enthusiastic about AI, always exploring new ways to innovate and improve processes",
    "links": {
      "linkedInTitle": "My LinkedIn profile",
      "githubTitle": "My Github profile",
      "emailTitle": "Send me an e-mail",
      "downloadTitle": "Download Resume",
      "downloadText": "Download"
    },
    "aside": {
      "portfolio": "Isaque | Portfolio",
      "skills": {
        "core": {
          "title": "Core Skills"
        },
        "others": {
          "title": "Others",
          "skills": {
            "one": "Design Systems",
            "two": "Responsive Web Design",
            "three": "Performance Optimization",
            "four": "ETL Process",
            "five": "Clean Code",
            "six": "Git",
            "seven": "Rest API"
          }
        }
      }
    },
    "experiences": {
      "title": "Experiences",
      "subtitle": "I've worked on a handful of web projects over the years, some of which were for the following organizations:",
      "jobs": {
        "one": {
          "role": "Full Stack Developer",
          "period": "March/Jun 2021",
          "description": "Responsible for creating web applications from scratch and implementing new features in existing applications. I acted on requirements analysis, front-end development, and back-end development, ensuring efficient integration between different systems. I used good programming practices and agile development principles to deliver high-quality and scalable solutions.",
          "activities": {
            "one": "Creation of features and support for front-end applications using React.js, Next.js, Gatsby.js, and other technologies.",
            "two": "Creation of features and support for back-end applications using Node.js, Express.js, Koa.js, Nest.js, and other technologies.",
            "three": "Control of version control with Git.",
            "four": "Utilization of cloud services such as AWS, including EC2, SES, and Lambda."
          }
        },
        "two": {
          "role": "Systems Analyst",
          "period": "Jan 2022-Present",
          "description": "Worked as a systems analyst and full-stack developer, creating complex systems from scratch and providing support for existing applications. Responsible for requirements analysis and gathering, interface creation, back-end services development (including APIs, automated processes, scheduled tasks, and ETL processes), relational database structure modeling, and implementation.",
          "activities": {
            "one": "Creation of features and support for existing front-end functionalities with jQuery.",
            "two": "Development of APIs REST with Node.js.",
            "three": "Development of structures and processes with relational databases (SQL Server).",
            "four": "Analysis of requirements and system modeling.",
            "five": "Creation of automated processes.",
            "six": "Creation of ETL processes (Extract, Transform, Load) with Python and SQL Server."
          }
        }
      }
    },
    "projects": {
      "title": "Projects",
      "text": "Links to some of my work can be found on isaquedev/projects and details can be provided upon request via a scheduled demo call."
    },
    "errors": {
      "generateResume": "Failed to generate resume",
      "localeNotProvided": "Locale not provided"
    },
    "loadingSpinner": { "message": "Generating résumé..." }
  },
  "navbar": {
    "about": "About",
    "experiences": "Experiences",
    "projects": "Projects",
    "resume": "My Résumé",
    "sayHello": "Say Hello",
    "links": {
      "githubTitle":"My Github",
      "linkedInTitle":"My LinkedIn"
    },
    "menuButton": {
      "open": "Open Menu",
      "close": "Close Menu"
    },
    "accessibility": {
      "title": "Accessibility",
      "theme": {
        "dark": "Switch to dark mode",
        "light": "Switch to light mode"
      },
      "languages": {
        "english": "English",
        "portuguese": "Portuguese"
      }
    }
  },
  "footer": {
    "copyright": "Copyright © 2024 Isaque Duarte",
    "whatsappLink": "https://wa.me/5511964957516?text=Hello%2C%20I%20would%20like%20to%20request%20a%20consultation"
  },
  "loadingSpinner": { "message": "Loading..." }
}